{

    "homeWord": "الرئيسية",
    "aboutWord": "من أنا",
    "techWord": "التقنيات",
    "workWord": "المشاريع",
    "contactWord": "تواصل معي",

    "languageWord": "اللغة",
    "englishWord": "الإنجليزية",
    "arabicWord": "العربية",

    "aboutTitle": "معلومات عني",

    "gitHubWord": "جيت هاب",
    "downloadCvWord": "السيرة الذاتية",

    "myName": "عمر خالد محمد",

    "roleWord": "الوظيفة",
    "roleContent": "مطور واجهات أمامية",

    "phoneWord": "رقم الهاتف",

    "emailWord": "البريد الإلكتروني",

    "achieveCardTitle1": "إجمالي العملاء",
    "achieveCardTitle2": "إجمالي المشاريع",
    "achieveCardTitle3": "سنوات الخبرة",

    "techTitle": "التقنيات و الأدوات",

    "techDataTitle1": "إتش تي إم إل",
    "techDataTitle2": "سي إس إس",
    "techDataTitle3": "جافا سكريبت",
    "techDataTitle4": "جي كويري",
    "techDataTitle5": "بوتستراب",
    "techDataTitle6": "تايلويند",
    "techDataTitle7": "ريآكت جي إس",
    "techDataTitle8": "ريدوكس جي إس",
    "techDataTitle9": "نود جي إس",
    "techDataTitle10": "إكسبريس جي إس",
    "techDataTitle11": "مونجو دي بي",
    "techDataTitle12": "في إس كود",
    "techDataTitle13": "جيت",
    "techDataTitle14": "جيت هاب",
    "techDataTitle15": "فيت",
    "techDataTitle16": "كروم",
    "techDataTitle17": "فريمر موشن",
    "techDataTitle18": "واجهة برمجة التطبيقات",
    "techDataTitle19": "جي دبليو تي",
    "techDataTitle20": "تشارت جي إس",

    "projectsTitle": "المشاريع",

    "projectName1": "معرض أعمال",
    "projectName2": "معرض الصور",
    "projectName3": "نظام إدارة بيانات",
    "projectName4": "لعبة إكس أو",
    "projectName5": "موقع كورسات",
    "projectName6": "حاسبة العمر",
    "projectName7": "تطبيق النصائح",
    "projectName8": "تطبيق الأفلام",
    "projectName9": "متجر",
    "projectName10": "مطعم",
    "projectName11": "لوحة تحكم ليلاك",
    "projectName12": "متجر الكتب",
    "projectName13": "موقع كودينج ديفيلوبر",
    "projectName14": "نظام منتجات",
    "projectName15": "سنفور",
    "projectName16": "لوحة تحكم وطفة",
    "projectName17": "موقع وطفة",

    "projectDesc1": "ملف تعريفي تجريبي. تم تصميم هذا الملف التعريفي كمنصة لعرض أولى مشاريعي التي قمت ببنائها خلال رحلتي في تعلم تطوير الواجهة الأمامية. يهدف المشروع إلى اختبار إتقاني للأساسيات وتعزيز مهاراتي من خلال إنشاء مشاريع واقعية تعكس تقدمي في هذا المجال.",
    "projectDesc2": "مشروع المعرض. تم تطوير هذا المشروع كتدريب على JavaScript، حيث يتيح للمستخدمين اختيار صورة من المعرض ليتم عرضها في بطاقة أكبر مع تفاصيل إضافية. الهدف من المشروع هو تعزيز فهمي للتفاعلات الديناميكية ومعالجة البيانات باستخدام JavaScript.",
    "projectDesc3": "مشروع نظام CRUDS. تم بناء هذا المشروع باستخدام HTML وCSS وJavaScript كتدريب عملي لتنفيذ نظام CRUD (إضافة - قراءة - تحديث - حذف) لإدارة البيانات ديناميكيًا. يتيح المشروع للمستخدمين إضافة البيانات وعرضها وتحريرها وحذفها بسهولة، مما يجعله أداة مثالية لفهم كيفية التعامل مع البيانات في الواجهة الأمامية دون الحاجة إلى قاعدة بيانات خلفية.",
    "projectDesc4": "مشروع لعبة X O. تم تطوير هذا المشروع كتدريب عملي على jQuery، حيث يدعم التخزين المحلي (Local Storage) لحفظ حالة اللعبة حتى بعد إعادة تحميل الصفحة. تتميز اللعبة بالتفاعل الديناميكي وتحديث الواجهة باستخدام التلاعب بـ DOM ومعالجة الأحداث باستخدام jQuery، مما يضمن تجربة مستخدم سلسة.",
    "projectDesc5": "موقع دورات تعليمية عبر الإنترنت. هذا هو أكبر مشروع قمت ببنائه باستخدام JavaScript، حيث يقدم منصة تعليمية متكاملة للدورات التدريبية مع تجربة احترافية وتفاعلية. يحتوي الموقع على عدة صفحات، مثل: الصفحة الرئيسية التي تعرض الدورات المختلفة مع خطط التسعير، وصفحة معلومات توضح رؤية المنصة وأهدافها، وصفحات تسجيل الدخول وإنشاء الحساب لتوفير تجربة مخصصة للمستخدمين، بالإضافة إلى قسم للتواصل مع الدعم الفني بسهولة.",
    "projectDesc6": "تطبيق حساب العمر. هذا التطبيق هو أداة ديناميكية وتفاعلية لحساب عمر المستخدم بناءً على تاريخ ميلاده المدخل. تم تطويره باستخدام React لتوفير وظائف سلسة، وCSS لتنسيق أنيق، وFramer Motion لإضافة رسوم متحركة سلسة تعزز تجربة المستخدم.",
    "projectDesc7": "تطبيق النصائح. يوفر هذا التطبيق نصيحة عشوائية كلما نقر المستخدم على الزر، حيث يعتمد على API خارجي لجلب نصائح جديدة بشكل ديناميكي. تم تطويره باستخدام React للتفاعل السلس، وCSS لتنسيق نظيف، وFramer Motion لرسوم متحركة سلسة تعزز تجربة المستخدم.",
    "projectDesc8": "تطبيق الأفلام. يتيح هذا التطبيق للمستخدمين استكشاف الأفلام من خلال جلب البيانات من API خارجي، حيث يعرض تفاصيل مثل العنوان، التقييم، تاريخ الإصدار، والملخص. تم تطويره باستخدام React لتجربة سلسة وتفاعلية، مع تنسيقات CSS لتصميم نظيف ومتجاوب.",
    "projectDesc9": "موقع Shope - أول موقع تجارة إلكترونية متكامل. هذا المشروع هو أول موقع تجارة إلكترونية متكامل قمت بتطويره، حيث يوفر للمستخدمين تجربة تسوق سلسة. تم بناؤه باستخدام React لواجهة مستخدم تفاعلية، وCSS لتصميم نظيف ومتجاوب، مع تكامل API خارجي لجلب المنتجات وعرضها ديناميكيًا.",
    "projectDesc10": "تطبيق مطعم مع لوحة تحكم. هذا المشروع هو تطبيق إدارة مطعم متكامل، يتضمن موقعًا إلكترونيًا للمستخدمين لتصفح القوائم وطلب الطعام، بالإضافة إلى لوحة تحكم إدارية لإدارة الطلبات والمنتجات. تم تطويره باستخدام React لتفاعل سلس، وFramer Motion لرسوم متحركة سلسة، وCSS لتصميم حديث ومتجاوب.",
    "projectDesc11": "لوحة تحكم Lilac - أول مشروع مستقل لإدارة مواقع الشركات. لوحة تحكم Lilac هي لوحة تحكم مخصصة لإدارة محتوى موقع الشركة، مما يتيح للمسؤولين التحكم في المحتوى وتحديثه بسهولة. تم تطويره باستخدام React لواجهة مستخدم تفاعلية، وCSS لتصميم حديث ومتجاوب، مع تكامل API لإدارة البيانات ديناميكيًا.",
    "projectDesc12": "تطبيق متجر الكتب مع لوحة تحكم - مشروع التخرج في مبادرة رواد مصر الرقمية. هذا التطبيق هو متجر كتب إلكتروني متكامل، يتيح للمستخدمين تصفح الكتب والبحث عنها وشرائها بسهولة، مع توفير لوحة تحكم إدارية لإدارة الكتب والطلبات. تم بناء الواجهة الأمامية باستخدام React، بينما تم تطوير الخلفية بالكامل باستخدام Node.js وExpress وMongoDB وCloudinary وJWT، مما يضمن أداءً عالياً وأمانًا متقدماً. كما تم دمج Framer Motion لرسوم متحركة سلسة وتجربة مستخدم متميزة.",
    "projectDesc13": "صفحة هبوط لشركة برمجيات. هذه الصفحة تمثل الواجهة الرئيسية لشركة برمجيات، حيث تعرض خدمات الشركة بشكل منظم وواضح مع توفير قنوات تواصل سهلة. يدعم الموقع الوضعين الفاتح والداكن، ويتميز بتجربة سلسة وسهلة الاستخدام لضمان تفاعل مثالي للزوار.",
    "projectDesc14": "نظام المنتجات - عرض المنتجات، التصفية، والبحث. هذا المشروع هو منصة تفاعلية لعرض المنتجات، حيث يتيح للمستخدمين البحث والتصفية بسهولة للعثور على العناصر المطلوبة بسرعة. تم تطويره باستخدام React لتجربة ديناميكية، وCSS لتصميم أنيق ومتجاوب، وFramer Motion لرسوم متحركة سلسة تعزز تفاعل المستخدم.",
    "projectDesc15": "سانفور - متجر إلكتروني. سانفور هو متجر إلكتروني يتيح للمستخدمين تصفح المنتجات وإضافتها إلى السلة دون الحاجة لإنشاء حساب، حيث يتم تخزين العناصر محليًا باستخدام Local Storage. يتصل التطبيق بـ API فقط أثناء عملية الدفع لإتمام عمليات الشراء بكفاءة. تم تطويره باستخدام React لواجهة مستخدم ديناميكية، وCSS لتصميم حديث ومتجاوب.",
    "projectDesc16": "لوحة تحكم Watfa - لوحة إدارة تطبيق Watfa. لوحة تحكم Watfa هي لوحة إدارة شاملة تتيح للإدارة تتبع الطلبات، عرض الإحصائيات، مراجعة مستندات البائعين، والتحكم في حسابات المستخدمين بكفاءة. كما توفر أدوات لمراقبة عمليات تحويل الأموال واستقبال إشعارات المستخدمين. تم بناؤها باستخدام React لتفاعل سلس، وCSS لتصميم حديث ومتجاوب.",
    "projectDesc17": "موقع Watfa - موقع تعريفي لتطبيق Watfa. موقع Watfa هو موقع تعريفي يوفر معلومات عن تطبيق Watfa ويقدم روابط تحميل للمستخدمين. يتميز الموقع بتصميم حديث وجذاب، وتم تطويره باستخدام React للتفاعلات الديناميكية، وCSS لتنسيق أنيق ومتجاوب، وFramer Motion لرسوم متحركة سلسة تعزز تجربة المستخدم.",

    "displayMoreWord": "اظهر المزيد",

    "backWord": "عودة",

    "liveDemoWord": "عرض الموقع",
    
    "countCardTitle1": "التقنيات",
    "countCardTitle2": "المميزات",
    
    "techUsedWord": "التقنيات المستخدمة",

    "kefFeaturesWord": "الميزات الرئيسية",

    "features1n1": "تصميم بسيط ومنظم يعرض المشاريع بوضوح وسهولة في التصفح.",
    "features1n2": "خبرة عملية في تطوير الواجهة الأمامية باستخدام التقنيات الأساسية.",
    "features1n3": "تحسين مستمر يعكس نمو المهارات بمرور الوقت.",
    "features1n4": "مجموعة متنوعة من المشاريع التي تعكس فهمي لمفاهيم التصميم والتطوير الأساسية.",

    "features2n1": "واجهة مستخدم بسيطة وسلسة لعرض الصور بطريقة جذابة.",
    "features2n2": "عرض تفصيلي لكل صورة محددة في بطاقة منفصلة.",
    "features2n3": "تفاعل ديناميكي باستخدام JavaScript لتحسين تجربة المستخدم.",
    "features2n4": "تحسين مهارات التعامل مع الـ DOM من خلال تنفيذ وظائف التبديل والعرض.",

    "features3n1": "تصميم بسيط وسهل الاستخدام لعرض البيانات بشكل منظم.",
    "features3n2": "إمكانية الإضافة والتعديل والحذف بشكل ديناميكي باستخدام JavaScript.",
    "features3n3": "تخزين البيانات محليًا باستخدام Local Storage للحفاظ على المعلومات بعد إعادة تحميل الصفحة.",
    "features3n4": "تحسين مهارات التعامل مع الـ DOM وJavaScript من خلال تنفيذ عمليات CRUD العملية.",

    "features4n1": "واجهة مستخدم بسيطة وتفاعلية بتصميم نظيف.",
    "features4n2": "تحديثات ديناميكية باستخدام jQuery دون الحاجة إلى إعادة تحميل الصفحة.",
    "features4n3": "تخزين حالة اللعبة في Local Storage للحفاظ على التقدم.",
    "features4n4": "كشف الفائز تلقائيًا مع عرض رسالة توضح نتيجة اللعبة.",
    "features4n5": "إمكانية إعادة تعيين اللعبة بسهولة مع خيار لمسح البيانات المخزنة.",
    "features4n6": "تحسين مهارات التعامل مع الـ DOM وLocal Storage باستخدام jQuery من خلال التطبيق العملي.",

    "features5n1": "تصميم حديث وجذاب يعزز تجربة المستخدم.",
    "features5n2": "عرض منظم للدورات التدريبية مع تفاصيل واضحة عن الأسعار.",
    "features5n3": "نظام مصادقة المستخدم يسمح بتسجيل الدخول وإنشاء الحسابات.",
    "features5n4": "صفحة معلومات توضح رؤية المنصة والغرض منها.",
    "features5n5": "خيارات تواصل متعددة لتسهيل التفاعل مع الزوار.",
    "features5n6": "وظائف JavaScript متقدمة لموقع ديناميكي وتفاعلي.",

    "features6n1": "واجهة مستخدم بسيطة وأنيقة بتصميم حديث ومتجاوب.",
    "features6n2": "حساب دقيق للعمر بالسنوات والأشهر والأيام بناءً على إدخال المستخدم.",
    "features6n3": "حركات سلسة وجذابة باستخدام Framer Motion.",
    "features6n4": "أداء سريع وتفاعل فوري مع إدارة حالة React.",
    "features6n5": "تحسين تجربة المستخدم باستخدام تنبيهات التحقق من صحة الإدخالات.",

    "features7n1": "واجهة مستخدم بسيطة وجذابة لتجربة مستخدم ممتعة.",
    "features7n2": "جلب نصائح عشوائية من API خارجي بضغطة زر.",
    "features7n3": "حركات سلسة باستخدام Framer Motion لتحسين التفاعل.",
    "features7n4": "تحديث سهل للحصول على نصيحة جديدة فورًا.",
    "features7n5": "أداء سريع وتحديثات في الوقت الفعلي باستخدام React.",

    "features8n1": "واجهة مستخدم بسيطة وجذابة بتخطيط متجاوب بالكامل.",
    "features8n2": "جلب بيانات الأفلام من API خارجي لعرض الأفلام الرائجة والأعلى تقييمًا.",
    "features8n3": "وظيفة البحث للعثور على الأفلام حسب الاسم أو الفئة.",
    "features8n4": "معلومات تفصيلية عن كل فيلم، بما في ذلك العنوان والتقييم وتاريخ الإصدار والملخص.",
    "features8n5": "أداء سريع وتفاعل ديناميكي باستخدام إدارة حالة React.",

    "features9n1": "تصميم حديث ومتجاوب لتجربة مستخدم ممتازة عبر الأجهزة.",
    "features9n2": "عرض ديناميكي للمنتجات بجلب البيانات من API خارجي.",
    "features9n3": "نظام عربة التسوق لإضافة المنتجات وحساب الإجمالي.",
    "features9n4": "نظام تسجيل الدخول وإنشاء الحساب لتخزين بيانات المستخدم.",
    "features9n5": "صفحات منتجات تفصيلية تشمل السعر والوصف والصور.",
    "features9n6": "تصفية المنتجات والبحث لسهولة التنقل.",
    "features9n7": "إدارة الحالة باستخدام React لتحسين الأداء.",

    "features10n1": "تصميم حديث ومتجاوب لجميع الأجهزة.",
    "features10n2": "عرض القائمة مع تفاصيل مثل السعر والوصف والصور.",
    "features10n3": "نظام طلب سهل مع ميزة الإضافة إلى السلة.",
    "features10n4": "حركات سلسة وجذابة باستخدام Framer Motion.",
    "features10n5": "تصفية المنتجات والتصنيفات لسهولة التنقل في القائمة.",
    "features10n6": "إدارة المنتجات (إضافة، تعديل، حذف عناصر القائمة).",
    "features10n7": "تتبع الطلبات في الوقت الفعلي.",
    "features10n8": "لوحة تحكم للمبيعات والتحليلات لمراقبة أداء المطعم.",
    "features10n9": "واجهة تفاعلية وسهلة الاستخدام للتحكم السلس.",

    "features11n1": "إدارة المحتوى بسهولة عبر لوحة تحكم مخصصة.",
    "features11n2": "تصميم حديث ومتجاوب لاستخدام سلس.",
    "features11n3": "تكامل مع API لتحديث المحتوى في الوقت الفعلي.",
    "features11n4": "واجهة منظمة وسهلة الاستخدام للتحكم الإداري السلس.",
    "features11n5": "تحكم كامل في محتوى الموقع دون الحاجة إلى تعديلات في الكود مباشرة.",

    "features12n1": "تصميم حديث ومتجاوب لتجربة مستخدم سلسة.",
    "features12n2": "تصفح الكتب حسب الفئة أو البحث باستخدام الكلمات المفتاحية.",
    "features12n3": "صفحات كتب تفصيلية تعرض المؤلف والسعر والتقييمات.",
    "features12n4": "نظام عربة تسوق مع عملية دفع سهلة.",
    "features12n5": "حركات سلسة باستخدام Framer Motion لتحسين التفاعل.",
    "features12n6": "إدارة الكتب (إضافة، تعديل، حذف) مع رفع الصور باستخدام Cloudinary.",
    "features12n7": "تتبع وإدارة الطلبات لتسهيل العمليات.",
    "features12n8": "مصادقة آمنة باستخدام JWT لحماية بيانات المستخدم.",
    "features12n9": "تحليلات وإحصائيات المبيعات لمراقبة أداء المتجر.",

    "features13n1": "تصميم حديث ومتجاوب يضمن تجربة سلسة عبر جميع الأجهزة.",
    "features13n2": "عرض واضح وجذاب لخدمات الشركة بطريقة تفاعلية.",
    "features13n3": "تواصل سلس وفعال مع العملاء عبر خيارات اتصال مباشرة.",
    "features13n4": "دعم الوضع الفاتح والداكن لتجربة مستخدم مريحة وفقًا للتفضيلات.",

    "features14n1": "تصميم حديث ومتجاوب لجميع الأجهزة.",
    "features14n2": "عرض منظم للمنتجات مع تفاصيل مثل الاسم والسعر والصورة.",
    "features14n3": "نظام بحث متقدم لاكتشاف المنتجات بسرعة.",
    "features14n4": "تصفية المنتجات حسب الفئة أو السعر أو الخصائص الأخرى.",
    "features14n5": "حركات سلسة وجذابة باستخدام Framer Motion.",
    "features14n6": "أداء سريع وتفاعل ديناميكي باستخدام React.",

    "features15n1": "تصفح المنتجات بحرية دون الحاجة إلى حساب.",
    "features15n2": "إضافة المنتجات إلى السلة مع تخزينها في Local Storage.",
    "features15n3": "عملية دفع سلسة مع تكامل API عند الخروج فقط.",
    "features15n4": "تصميم حديث ومتجاوب لجميع الأجهزة.",
    "features15n5": "واجهة بسيطة وسهلة الاستخدام لتجربة تسوق مريحة.",

    "features16n1": "تتبع وإدارة الطلبات لضمان عمليات تشغيل فعالة.",
    "features16n2": "إحصائيات وتقارير لتحليل أداء النظام.",
    "features16n3": "مراجعة مستندات البائع للتحقق.",
    "features16n4": "إدارة حسابات المستخدمين مع إمكانية حظر الحسابات.",
    "features16n5": "نظام إشعارات للمستخدمين لتحسين التواصل.",
    "features16n6": "مراقبة تحويلات الأموال لتتبع المعاملات المالية.",
    "features16n7": "تصميم متجاوب وسهل الاستخدام للإدارة السلسة.",

    "features17n1": "معلومات تفصيلية عن التطبيق وكيفية استخدامه.",
    "features17n2": "روابط تنزيل مباشرة لأنظمة التشغيل المختلفة.",
    "features17n3": "تصميم حديث ومتجاوب لجميع الأجهزة.",
    "features17n4": "حركات سلسة وجذابة باستخدام Framer Motion.",
    "features17n5": "واجهة بسيطة وسهلة الاستخدام لتجربة سلسة.",

    "certificationsWord": "الشهادات",

    "certName1": "سولو ليرن - إتش تي إم إل",
    "certName2": "سولو ليرن - سي إس إس",
    "certName3": "سولو ليرن - جافا سكريبت",
    "certName4": "كورس برافو",
    "certName5": "تدريب برافو",
    "certName6": "الكس - إي آي سي إي",
    "certName7": "رواد مصر الرقمية - تدريب رقمي",
    "certName8": "رواد مصر الرقمية - تدريب بيزنيس",
    "certName9": "هاكاثون - ديف فيست",
    "certName10": "تنظيم - جي كامب",
    "certName11": "مبادرة كن فزلوك"

}