{

    "homeWord": "Home",
    "aboutWord": "About",
    "techWord": "Technologies",
    "workWord": "Projects",
    "contactWord": "Contact",

    "languageWord": "Language",
    "englishWord": "English",
    "arabicWord": "Arabic",

    "aboutTitle": "About Me",

    "gitHubWord": "GitHub",
    "downloadCvWord": "Download CV",

    "myName": "Omar Khaled Mohamed",

    "roleWord": "Role",
    "roleContent": "Front-End Developer",

    "phoneWord": "Phone Number",
    
    "emailWord": "Email Address",

    "achieveCardTitle1": "Total Clients",
    "achieveCardTitle2": "Total Projects",
    "achieveCardTitle3": "Years of experience",

    "techTitle": "Technologies & Tools",

    "techDataTitle1": "HTML",
    "techDataTitle2": "CSS",
    "techDataTitle3": "Java Script",
    "techDataTitle4": "Jquery",
    "techDataTitle5": "Bootstrap",
    "techDataTitle6": "Tailwind",
    "techDataTitle7": "React Js",
    "techDataTitle8": "Redux JS",
    "techDataTitle9": "Node Js",
    "techDataTitle10": "Express Js",
    "techDataTitle11": "Mongo DB",
    "techDataTitle12": "VS Code",
    "techDataTitle13": "Git",
    "techDataTitle14": "GitHub",
    "techDataTitle15": "Vite",
    "techDataTitle16": "Chrome",
    "techDataTitle17": "Framer Motion",
    "techDataTitle18": "API",
    "techDataTitle19": "JWT",
    "techDataTitle20": "Chart Js",

    "projectsTitle": "Projects",

    "projectName1": "Portfolio",
    "projectName2": "Gallery",
    "projectName3": "CRUDS System",
    "projectName4": "Tic Tac Toe",
    "projectName5": "Online Courses",
    "projectName6": "Age Calculator",
    "projectName7": "Advice App",
    "projectName8": "Movies App",
    "projectName9": "Shop",
    "projectName10": "Restaurant",
    "projectName11": "Lilac Dashboard",
    "projectName12": "Book Store",
    "projectName13": "Coding Developer Site",
    "projectName14": "Products System",
    "projectName15": "Sanfour",
    "projectName16": "Watfa Dashboard",
    "projectName17": "Watfa Site",

    "projectDesc1": "Experimental Portfolio This portfolio was designed as a platform to showcase the first projects I built during my journey of learning front-end development. The project aims to test my mastery of the fundamentals and enhance my skills by creating real-world projects that reflect my progress in this field.",
    "projectDesc2": "Gallery Project This project was developed as a JavaScript training exercise, allowing users to select an image from the gallery, which is then displayed in a larger card with additional details. The goal of this project is to enhance my understanding of dynamic interactions and data manipulation using JavaScript.",
    "projectDesc3": "CRUDS System Project This project was built using HTML, CSS, and JavaScript as a practical exercise to implement a CRUD system (Create - Read - Update - Delete) for managing data dynamically. The project allows users to add, view, edit, and delete data easily, making it an ideal tool for understanding how to handle data on the front end without requiring a backend database.",
    "projectDesc4": "Tic Tac Toe Project. This project was developed as a practical exercise on jQuery, featuring Local Storage support to save the game state even after a page reload. The Tic Tac Toe game is interactive and dynamically updates the interface using DOM manipulation and event handling with jQuery, ensuring a seamless user experience.",
    "projectDesc5": "Online Courses Website This is the largest project I have built using JavaScript, offering a complete platform for educational courses with a professional and interactive experience. The website includes multiple pages, such as: A homepage displaying various courses with pricing plans, An information page detailing the platform’s vision and goals, Login & Sign Up pages for personalized user experiences and a contact section for easy communication with support.",
    "projectDesc6": "Age Calculator App. This app is a dynamic and interactive tool for calculating a user’s age based on their inputted birthdate. Built with React for seamless functionality, CSS for clean styling, and Framer Motion to add smooth animations that enhance user engagement.",
    "projectDesc7": "Advice App. This app provides a random piece of advice whenever the user clicks a button, utilizing an external API to fetch fresh advice dynamically. It is built with React for seamless interaction, CSS for clean styling, and Framer Motion for smooth animations that enhance the user experience.",
    "projectDesc8": "Movies App. This app allows users to explore movies by fetching data from an external API, providing details such as title, rating, release date, and summary. Built with React for a smooth and interactive experience, and styled with CSS for a clean and responsive design.",
    "projectDesc9": "Shope Site - First Complete E-commerce Website This project is my first fully functional E-commerce website, offering users a seamless shopping experience. It is built with React for an interactive UI, styled with CSS for a clean and responsive design, and integrates with an external API to dynamically fetch and display products.",
    "projectDesc10": "Restaurant App with Dashboard. This project is a fully functional restaurant management app, featuring a user-facing website for browsing menus and placing orders, along with an admin dashboard for managing orders and products. It is built with React for seamless interaction, Framer Motion for smooth animations, and CSS for a modern and responsive design.",
    "projectDesc11": "Lilac Dashboard – First Freelance Project for Company Website Management Lilac Dashboard is a custom admin panel for managing a company’s website, allowing admins to easily control and update content. It was built with React for an interactive UI, styled with CSS for a modern and responsive design, and integrated with an API for dynamic data management.",
    "projectDesc12": "Book Store App with Dashboard – Digital Egypt Pioneers Initiative (DEPI) Graduation Project This application is a fully functional online bookstore, allowing users to browse, search, and purchase books easily, while featuring an admin dashboard for managing books and orders. The frontend is built with React, while the backend is fully developed using Node.js, Express, MongoDB, Cloudinary, and JWT, ensuring high performance and security. Additionally, Framer Motion is integrated for smooth animations and an engaging user experience.",
    "projectDesc13" : "Landing Page for Coding DeveloperThis landing page serves as the main interface for Coding Developer, showcasing the company's services in a clear and organized manner while providing easy communication channels. The website features light and dark mode support, along with a smooth and user-friendly experience to ensure optimal interaction for visitors.",
    "projectDesc14": "Products System – Product Listing, Filtering, and Search This project is an interactive platform for displaying products, allowing users to search and filter easily to find the desired items quickly. It is built using React for a dynamic experience, CSS for a sleek and responsive design, and Framer Motion for smooth animations that enhance user engagement.",
    "projectDesc15": "Sanfour – E-commerce Store. Sanfour is an e-commerce store that allows users to browse and add products to the cart without creating an account, as items are stored locally using Local Storage. The application connects to an API only during the checkout process to complete purchases efficiently. Built with React for a dynamic UI and CSS for a modern, responsive design.",
    "projectDesc16": "Watfa Dashboard – Admin Panel for Watfa App Watfa Dashboard is a comprehensive admin panel that allows management to track orders, view statistics, review vendor documents, and control user accounts efficiently. It also provides tools for monitoring money transfers and receiving user notifications. Built using React for interactivity and CSS for a modern, responsive design.",
    "projectDesc17": "Watfa Site – Informational Website for Watfa App Watfa Site is an informational website that provides details about the Watfa app and offers download links for users. The site features a modern and engaging design, built with React for dynamic interactions, CSS for a sleek and responsive layout, and Framer Motion for smooth animations that enhance user experience.",

    "displayMoreWord": "Display More",

    "backWord": "Back",

    "liveDemoWord": "Live Demo",

    "countCardTitle1": "Technologies",
    "countCardTitle2": "Features",

    "techUsedWord": "Technologies Used",

    "kefFeaturesWord": "Key Features",

    "features1n1": "A simple and organized design that presents projects clearly and is easy to navigate.",
    "features1n2": "Hands-on front-end development experience using fundamental technologies.",
    "features1n3": "Continuous improvement that reflects skill growth over time.",
    "features1n4": "A variety of projects demonstrating my understanding of core design and development concepts.",

    "features2n1": "A simple and smooth UI for displaying images in an engaging way.",
    "features2n2": "Detailed view of each selected image in a separate card.",
    "features2n3": "Dynamic interaction using JavaScript to improve user experience.",
    "features2n4": "Enhanced DOM manipulation skills through implementing switching and display functions.",

    "features3n1": "A simple and user-friendly design for displaying data in an organized manner.",
    "features3n2": "Dynamic add, edit, and delete functionality using JavaScript.",
    "features3n3": "Local data storage with Local Storage to retain information after page reloads.",
    "features3n4": "Enhanced DOM and JavaScript skills through hands-on CRUD implementation.",

    "features4n1": "A simple and interactive user interface with a clean design.",
    "features4n2": "jQuery-powered dynamic updates without needing a page reload.",
    "features4n3": "Game state storage in Local Storage to preserve progress.",
    "features4n4": "Automatic winner detection with a message displaying the game result.",
    "features4n5": "Easy game reset with an option to clear stored data.",
    "features4n6": "Enhanced skills in DOM manipulation and Local Storage with jQuery through hands-on implementation.",

    "features5n1": "Modern and visually appealing design enhancing user experience.",
    "features5n2": "Well-structured course display with clear pricing details.",
    "features5n3": "User authentication system allowing login and account creation.",
    "features5n4": "Informational page explaining the platform’s vision and purpose.",
    "features5n5": "Multiple contact options to facilitate interaction with visitors.",
    "features5n6": "Advanced JavaScript functionality for a dynamic and interactive site.",

    "features6n1": "Simple and elegant UI with a modern, responsive design.",
    "features6n2": "Accurate age calculation in years, months, and days based on user input.",
    "features6n3": "Smooth and attractive animations powered by Framer Motion.",
    "features6n4": "Fast performance and real-time interaction with React state management.",
    "features6n5": "Enhanced user experience with validation alerts for incorrect inputs.",

    "features7n1": "Simple and engaging UI for an enjoyable user experience.",
    "features7n2": "Fetches random advice from an external API with a button click.",
    "features7n3": "Smooth animations powered by Framer Motion for better interaction.",
    "features7n4": "Easy refresh to get new advice instantly.",
    "features7n5": "Fast performance and real-time updates using React state management.",

    "features8n1": "Simple and visually appealing UI with a fully responsive layout.",
    "features8n2": "Fetches movie data from an external API to display trending and top-rated films.",
    "features8n3": "Search functionality to find movies by name or category.",
    "features8n4": "Detailed movie information, including title, rating, release date, and summary.",
    "features8n5": "Fast performance and dynamic interaction using React state management.",

    "features9n1": "Modern and responsive design for an excellent user experience across devices.",
    "features9n2": "Dynamic product display by fetching data from an external API.",
    "features9n3": "Shopping cart system to add products and calculate the total.",
    "features9n4": "Login & Sign Up system to store user data.",
    "features9n5": "Detailed product pages including price, description, and images.",
    "features9n6": "Product filtering and search for easy navigation.",
    "features9n7": "State management with React for improved performance.",

    "features10n1": "Modern and responsive design for all devices.",
    "features10n2": "Menu display with details like price, description, and images.",
    "features10n3": "Easy ordering system with an add-to-cart feature.",
    "features10n4": "Smooth and engaging animations powered by Framer Motion.",
    "features10n5": "Filtering and categorization for easy menu navigation.",
    "features10n6": "Product management (add, edit, delete menu items).",
    "features10n7": "Order tracking in real-time.",
    "features10n8": "Sales and analytics dashboard to monitor restaurant performance.",
    "features10n9": "Interactive and user-friendly interface for easy control.",

    "features11n1": "Easy content management through a dedicated dashboard.",
    "features11n2": "Modern and responsive design for smooth usability.",
    "features11n3": "API integration for real-time content updates.",
    "features11n4": "User-friendly and structured interface for seamless admin control.",
    "features11n5": "Full control over website content without direct code modifications.",

    "features12n1": "Modern and responsive design for seamless user experience.",
    "features12n2": "Browse books by category or search using keywords.",
    "features12n3": "Detailed book pages displaying author, price, and ratings.",
    "features12n4": "Shopping cart system with an easy checkout process.",
    "features12n5": "Smooth animations using Framer Motion for enhanced interactivity.",
    "features12n6": "Book management (add, edit, delete books) with Cloudinary for image uploads.",
    "features12n7": "Order tracking and management for smooth operations.",
    "features12n8": "Secure authentication with JWT to protect user data.",
    "features12n9": "Sales analytics and statistics to monitor store performance.",

    "features13n1": "Modern and responsive design ensuring a smooth experience across all devices.",
    "features13n2": "Clear and engaging presentation of company services in an interactive way.",
    "features13n3": "Seamless communication and interaction with clients through direct and effective contact options.",
    "features13n4": "Light and dark mode support for a comfortable user experience based on preferences.",

    "features14n1": "Modern and responsive design for all devices.",
    "features14n2": "Well-structured product display with details like name, price, and image.",
    "features14n3": "Advanced search system for quick product discovery.",
    "features14n4": "Product filtering by category, price, or other attributes.",
    "features14n5": "Smooth and engaging animations using Framer Motion.",
    "features14n6": "Fast performance and dynamic interaction powered by React state management.",

    "features15n1": "Browse products freely without requiring an account.",
    "features15n2": "Add products to cart with storage in Local Storage.",
    "features15n3": "Smooth checkout process with API integration only at Checkout.",
    "features15n4": "Modern and responsive design for all devices.",
    "features15n5": "Simple and user-friendly interface for an effortless shopping experience.",

    "features16n1": "Order tracking and management for efficient operations.",
    "features16n2": "Statistics and reporting to analyze system performance.",
    "features16n3": "Vendor document review for verification.",
    "features16n4": "User account control with the ability to ban accounts.",
    "features16n5": "User notifications system for better communication.",
    "features16n6": "Money transfer monitoring to track financial transactions.",
    "features16n7": "Responsive and user-friendly design for seamless administration.",

    "features17n1": "Detailed information about the app and how to use it.",
    "features17n2": "Direct download links for different platforms.",
    "features17n3": "Modern and responsive design for all devices.",
    "features17n4": "Smooth and engaging animations using Framer Motion.",
    "features17n5": "Simple and user-friendly interface for a seamless experience.",

    "certificationsWord": "Certifications",

    "certName1": "Sololearn-HTML",
    "certName2": "Sololearn-CSS",
    "certName3": "Sololearn-Java Script",
    "certName4": "Bravo Course",
    "certName5": "Bravo Training",
    "certName6": "ALX-AICE",
    "certName7": "DEPI Technical Training",
    "certName8": "DEPI Business Training",
    "certName9": "DevFest Hackathon",
    "certName10": "G-Camp Organization",
    "certName11": "Be Faazzlook Initiative"

}